import '../index.css';

import { useEffect } from 'react';

const About = () => {
	useEffect(() => {
		window.scrollTo(0, 0);
	}, []);

	return (
		<div className='bg-footer max-w-[1440px] m-auto'>
			<div
				className='flex items-center justify-center bg-black bg-opacity-50 ${
					isWideScreen'>
				<div className='flex flex-col gap-3 px-5 bg-opacity-50 py-14 rounded-3xl align-items-center lg:px-28 text-slate-100'>
					{/* <h1 className='text-2xl font-semibold'>ХТО МИ?</h1>
                    <p>Команда розробників сайту ігор української локалізації!</p>
                    <p>Ми є групою ентузіастів, які збираються разом, щоб зробити геймінг доступним для україномовних гравців у всьому світі. Наша команда складається з індивідів різних професій, що об'єднані спільною метою — створення інтуїтивного та захоплюючого ігрового досвіду українською мовою.</p>
                    <p className='font-bold capitalize'>Наша місія – популяризація україномовного геймінгу.</p>
                    <p>Наша мета – забезпечити доступ до якісних ігор та геймінгового контенту українською мовою.</p>
                    <p>Ми розуміємо важливість інтуїтивного і зручного інтерфейсу, ефективної ігрової функціональності для української аудиторії.</p>
                    <p>Саме тому наша команда зосередила особливу увагу на налаштуванні функцій, що забезпечують зручну навігацію, пошук та фільтрацію ігор.</p>
                    <p>Крім того, нами забезпечено можливість реєстрації користувачів та налаштування функціоналу особистих профілів, який дозволяє гравцям зберігати свої побажання, залишати коментарі та власні огляди.</p>
                    <p>Наша команда:</p>
                    <p>Project manager - Тетяна Файчук</p>
                    <p>Designer - Ганна Дербеньова</p>
                    <p>Back End - Олександр Нагленко</p>
                    <p>Front End - Віктор Філіппов</p>
                    <p>QA - Роман Глущевський</p>
                    <p>QA - Наталя Карасюк</p> */}
					<h1 className='text-2xl font-semibold text-center'>
						ХТО МИ?
					</h1>
					<h2 className='text-xl font-bold text-center capitalize'>
						Команда розробників сайту ігор української локалізації!
					</h2>
					<p>
						Ми є групою ентузіастів, які збираються разом, щоб
						зробити геймінг доступним для україномовних гравців у
						всьому світі. Наша команда складається з індивідів
						різних професій, що об'єднані спільною метою — створення
						інтуїтивного та захоплюючого ігрового досвіду
						українською мовою.
					</p>
					<h2 className='text-xl font-bold text-center capitalize'>
						Наша місія – популяризація україномовного геймінгу.
					</h2>
					<p>
						Ми віримо в силу української мови та потенціал нашої
						геймінг-спільноти. Наша місія полягає в популяризації
						україномовного геймінгу та створенні умов для гравців
						отримувати від нього задоволення та розвагу. Ми
						відстоюємо принципи доступності, рівності та
						різноманітності у світі геймінгу.
					</p>
					<p>
						Ми розуміємо важливість інтуїтивного і зручного
						інтерфейсу, ефективної ігрової функціональності для
						української аудиторії. Саме тому наша команда зосередила
						особливу увагу на налаштуванні функцій, що забезпечують
						зручну навігацію, пошук та фільтрацію ігор.
					</p>
					<h2 className='text-xl font-bold text-center capitalize'>
						Наша команда:
					</h2>
					<p>
						<span className='text-sky-300'>
							Project manager - Тетяна Файчук:
						</span>{' '}
						Тетяна відповідає за керування нашими проектами та
						забезпеченням, щоб ми завжди дотримувалися наших цілей
						та графіку розробки
					</p>
					<p>
						<span className='text-sky-300'>
							Designer - Ганна Дербеньова:
						</span>{' '}
						Ганна відповідає за дизайн нашого сайту та ігор,
						забезпечуючи гарний та привабливий вигляд
					</p>
					<p>
						<span className='text-sky-300'>
							Back End - Олександр Нагленко:
						</span>{' '}
						Олександр розробляє серверну частину нашої платформи та
						забезпечує її надійність та швидкодію
					</p>
					<p>
						<span className='text-sky-300'>
							Front End - Віктор Філіппов:
						</span>{' '}
						Віктор відповідає за фронт-енд розробку, створення
						інтерфейсу та користувацького досвіду
					</p>
					<p>
						<span className='text-sky-300'>
							QA - Роман Глущевський та Наталя Карасюк:
						</span>{' '}
						Роман і Наталя виконують роль тестерів, перевіряючи наші
						продукти на помилки та забезпечуючи їх якість
					</p>
					<p>
						Ми пишаємося тим, що маємо можливість працювати над
						створенням веб-платформи для геймерів, яка говорить
						нашою мовою та відповідає нашим потребам. Наша команда
						завжди відкрита для співпраці та пропозицій від наших
						користувачів.
					</p>
					<h2 className='text-xl font-bold text-center capitalize'>
						Технології, які ми використовуємо:
					</h2>
					<ul className='ml-5 list-disc'>
						<li className='mb-2'>
							Front End: Наш клієнтський сторінка розроблений з
							використанням JavaScript та фреймворка React, що
							дозволяє нам створювати динамічний та відмінний за
							дизайном інтерфейс. Ми також використовуємо
							CSS-фреймворк Tailwind CSS для створення стильного
							та сучасного вигляду.
						</li>
						<li className='mb-2'>
							Build Tool: Для збирання та оптимізації нашого
							JavaScript-коду та ресурсів ми використовуємо Vite,
							що дозволяє нам створювати ефективну структуру
							проекту та зменшувати завантаження сторінки.
						</li>
						<li className='mb-2'>
							Back End: Наш серверний стек побудований на основі
							платформи .NET, що включає в себе C# та .NET Core.
							Для зберігання даних ми використовуємо PostgreSQL,
							що забезпечує надійність та швидкість наших послуг.
						</li>
						<li className='mb-2'>
							Designer: Наш дизайн створюється з використанням
							графічних програм та інструментів для створення
							ілюстрацій та дизайну ігрових персонажів. Ми
							використовуємо Figma для розробки та співпраці над
							дизайном.
						</li>
						<li>
							QA: Для забезпечення якості наших продуктів ми
							використовуємо ручне тестування з використанням
							сучасних тестувальних інструментів.
						</li>
					</ul>
				</div>
			</div>
		</div>
	);
};

export default About;
